In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("ex1.csv")
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
df = pd.read_csv("ex1.csv", header=None, names=list('abcde'))
df

   a   b   c   d        e
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [13]:
type(df)

pandas.core.frame.DataFrame

In [9]:
type(pd.DataFrame(df))

pandas.core.frame.DataFrame

In [15]:
df = pd.read_csv('ex5.csv', header=None)
df

           0  1   2    3   4        5
0  something  a   b    c   d  message
1        one  1   2    3   4      NaN
2        two  5   6  NaN   8    world
3      three  9  10   11  12      foo

In [18]:
df = pd.read_csv('ex5.csv', header=None, names=list('abcdef'), na_values=['one', 'two'])
df

           a  b   c    d   e        f
0  something  a   b    c   d  message
1        NaN  1   2    3   4      NaN
2        NaN  5   6  NaN   8    world
3      three  9  10   11  12      foo

In [19]:
df.isnull().sum()

a    2
b    0
c    0
d    1
e    0
f    1
dtype: int64

In [20]:
df = pd.read_csv('ex5.csv', header=None, names=list('abcdef'), nrows=2)
df

           a  b  c  d  e        f
0  something  a  b  c  d  message
1        one  1  2  3  4      NaN

In [29]:
df = pd.read_csv('stock_px.csv')
df.head()

,Unnamed: 0,AA,AAPL,GE,IBM,JNJ,MSFT,PEP,SPX,XOM
0,1990-02-01 00:00:00,4.98,7.86,2.87,16.79,4.27,0.51,6.04,328.79,6.12
1,1990-02-02 00:00:00,5.04,8.00,2.87,16.89,4.37,0.51,6.09,330.92,6.24
2,1990-02-05 00:00:00,5.07,8.18,2.87,17.32,4.34,0.51,6.05,331.85,6.25
3,1990-02-06 00:00:00,5.01,8.12,2.88,17.56,4.32,0.51,6.15,329.66,6.23
4,1990-02-07 00:00:00,5.04,7.77,2.91,17.93,4.38,0.51,6.17,333.75,6.33

In [30]:
df.shape

(5472, 10)

In [31]:
df.columns

Index(['Unnamed: 0', 'AA', 'AAPL', 'GE', 'IBM', 'JNJ', 'MSFT', 'PEP', 'SPX',
       'XOM'],
      dtype='object')

In [32]:
df.rename(columns={'Unnamed: 0':'DateTime'}, inplace=True)
df.head()

,DateTime,AA,AAPL,GE,IBM,JNJ,MSFT,PEP,SPX,XOM
0,1990-02-01 00:00:00,4.98,7.86,2.87,16.79,4.27,0.51,6.04,328.79,6.12
1,1990-02-02 00:00:00,5.04,8.00,2.87,16.89,4.37,0.51,6.09,330.92,6.24
2,1990-02-05 00:00:00,5.07,8.18,2.87,17.32,4.34,0.51,6.05,331.85,6.25
3,1990-02-06 00:00:00,5.01,8.12,2.88,17.56,4.32,0.51,6.15,329.66,6.23
4,1990-02-07 00:00:00,5.04,7.77,2.91,17.93,4.38,0.51,6.17,333.75,6.33

In [33]:
df.describe()

,AA,AAPL,GE,IBM,JNJ,MSFT,PEP,SPX,XOM
count,5472.000000,5472.000000,5472.000000,5472.000000,5472.000000,5472.000000,5471.000000,5472.000000,5472.000000
mean,17.440285,57.119313,17.933194,66.637730,34.225340,17.046345,34.284204,945.035216,35.225919
std,9.647999,88.670423,10.647635,41.689481,19.726666,11.000988,18.383894,369.494672,23.967647
min,4.200000,3.230000,2.400000,8.400000,4.200000,0.510000,5.870000,295.460000,5.940000
25%,8.077500,8.760000,6.280000,20.577500,12.160000,4.240000,15.480000,547.217500,11.910000
50%,14.885000,11.990000,18.150000,74.115000,37.570000,20.910000,33.750000,1058.305000,30.280000
75%,26.340000,68.017500,27.300000,95.657500,52.675000,25.310000,49.530000,1253.395000,55.300000
max,43.620000,422.000000,42.780000,190.530000,67.320000,46.810000,71.250000,1565.150000,87.480000

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5472 entries, 0 to 5471
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DateTime  5472 non-null   object
 1   AA        5472 non-null   float64
 2   AAPL      5472 non-null   float64
 3   GE        5472 non-null   float64
 4   IBM       5472 non-null   float64
 5   JNJ       5472 non-null   float64
 6   MSFT      5472 non-null   float64
 7   PEP       5471 non-null   float64
 8   SPX       5472 non-null   float64
 9   XOM       5472 non-null   float64
dtypes: float64(9), object(1)
memory usage: 427.6+ KB

In [35]:
df.isnull().sum()

DateTime    0
AA          0
AAPL        0
GE          0
IBM         0
JNJ         0
MSFT        0
PEP         1
SPX         0
XOM         0
dtype: int64

In [36]:
df.dtypes

DateTime     object
AA          float64
AAPL        float64
GE          float64
IBM         float64
JNJ         float64
MSFT        float64
PEP         float64
SPX         float64
XOM         float64
dtype: object